Repository: GeroVeni/Logic-Simulator
Catalog: logic-sim/locale/*/LC_MESSAGES/I18Nwxapp.po
Languages: el

source: &Open
el: &Άνοιγμα

source: &Reload
el: Αναν&έωση

source: &Exit
el: &Έξοδος

source: &Center
el: Επαναφο&ρά στο κέντρο

source: &Toggle 2D/3D view
el: Εναλλα&γή 2D/3D προβολής

source: &Clear Activity Log
el: &Καθαρισμός λίστας ενεργειών

source: R&un
el: Ε&κτέλεση

source: &Continue
el: Σ&υνέχεια εκτέλεσης

source: Change &Language
el: Αλλαγή Γ&λώσσας

source: &Help
el: &Βοήθεια

source: &About
el: &Σχετικά

source: &File
el: Α&ρχείο

source: &View
el: &Προβολή

source: &Simulation
el: Πρ&οσομοίωση

source: O&ptions
el: Ε&πιλογές

source: Help
el: Βοήθεια

source: Ready. Please load a file.
el: Έτοιμο. Παρακαλώ φορτώστε ένα αρχείο.

source: Activity Log
el: Λίστα ενεργειών

source: Monitors
el: Έλεγχος

source: Switches
el: Πηγές

source: &Toggle 2D/3D vew
el: Εναλλα&γή 2D/3D προβολής

source: &Run
el: Εκ&τέλεση

source: Error: Monitor {} not found.
el: Σφάλμα: Ο ελεγκτής {} δεν βρέθηκε.

source: activated
el: ενεργοποιήθηκε

source: Monitor {} was {}.
el: Ο ελεγκτής {} {}.

source: deactivated
el: απενεργοποιήθηκε

source: Monitor changed
el: Αλλαγή κατάστασης ελεγκτή

source: ON
el: άνοιξε

source: OFF
el: έκλεισε

source: Switch {} was switched {}
el: Ο διακόπτης {} {}.

source: Succesfully parsed network.
el: Η συντακτική ανάλυση ήταν επιτυχής.

source: Failed to parse network.
el: Η συντακτική ανάλυση απέτυχε.

source: Open file dialog.
el: Άνοιγμα αρχείου.

source: Open
el: Άνοιγμα

source: File opened: {}
el: Άνοιγμα αρχείου: {}

source: Opened file
el: Άνοιγμα αρχείου

source: Error! No file loaded.
el: Σφάλμα! Δεν έχει φορτωθεί αρχείο.

source: Error! Network oscillating.
el: Σφάλμα! Το σύστημα πάλλεται.

source: Running for {} cycles
el: Εκτέλεση για {} κύκλους

source: RUN
el: Εκτέλεση

source: Error! Nothing to continue. Run first.
el: Σφάλμα! Δεν έχει εκτελεστεί αρχείο. Εκτελέστε πρώτα.

source: Continuing for {} cycles. Total: {}
el: Συνέχιση εκτέλεσης για {} κύκλους. Συνολικά: {}

source: Continue
el: Συνέχεια εκτέλεσης

source: Center canvas.
el: Επαναφορά στο κέντρο.

source: Help - Program controls
el: Βοήθεια - Οδηγίες προγράμματος

source: Shortcuts:
el: Συντομεύσεις:

source: Ctrl + O: Open file
el: Ctrl + O: Άνοιγμα αρχείου

source: Ctrl + H: Help
el: Ctrl + H: Βοήθεια

source: Ctrl + R: Run
el: Ctrl + R: Εκτέλεση

source: Ctrl + Shift + C: Continue
el: Ctrl + Shift + C: Συνέχεια εκτέλεσης

source: Ctrl + E: Center canvas
el: Ctrl + E: Επαναφορά στο κέντρο

source: Ctrl + T: Toggle 2D/3D view
el: Ctrl + T: Εναλλαγή 2D/3D προβολής

source: Ctrl + L: Clear activity log
el: Ctrl + L: Καθαρισμός λίστας ενεργειών

source: User Instructions:
el: Οδηγίες προς τον χρήστη:

source: Use the Open file button to select
el: Χρησιμοποιήστε το κουμπί "Άνοιγμα αρχείου" για να επιλέξετε

source: the desired circuit defnition file.
el: το επιθυμητό αρχείο κυκλώματος.

source: If the file contains no errors the activity
el: Αν το αρχείο δεν περιέχει σφάλματα, η λίστα

source: log at the bottom of the window
el: ενεργειών στο κάτω μέρος του παραθύρου

source: will read "Succesfully parsed network".
el: θα δείξει "Η συντακτική ανάλυση ήταν επιτυχής".

source: If there are errors, the error log
el: Αν υπάρχουν σφάλματα, η λίστα ενεργειών

source: will read "Failed to parse network".
el: θα δείξει "Η συντακτική ανάλυση απέτυχε".

source: If the network was parsed correctly it can be ran.
el: Αν η συντακτική ανάλυση ήταν επιτυχής, το σύστημα μπορεί να εκτελεστεί.

source: Use the plus and minus on the
el: Χρησιμοποιήστε τα κουμπιά συν και πλην πάνω στον δείκτη

source: cycle selector to select the desired number
el: των κύκλων για να επιλέξετε τον επιθυμητό αριθμό

source: of cycles for the simulation or
el: κύκλων για την προσομοίωση ή

source: type in th desired number. Press the Run
el: πληκτρολογίστε τον στο πλάισιο. Πατήστε το εικονίδιο "Εκτέλεση"

source: button to run the simulator for the number
el: για να εκτελέσετε την προσομοίωση για τον αριθμό

source: of cycles selected and display the waveforms
el: των κύκλων που αναγράφεται στον αντίστοιχο δείκτη και θα εμφανίσετε τα σήματα

source: at the current monitor points (from a
el: που αντιστοιχούν στους επιλεγμένους ελεγκτές (ξεκινώντας

source: cold-startup of the circuit). Press the
el: από ένα cold-startup του κυκλώματος). Πατήστε το

source: Continue button to run the simulator
el: εικονίδιο "Συνέχεια εκτέλεσης" για να εκτελέσετε την προσομοίωση

source: for an additional number of cycles as selected
el: για έναν επιπλέον αριθμό κύκλων, όπως έχουν επιλεγεί

source: in the cycle selector and
el: στον δείκτη κύκλων και

source: display the waveforms at the current monitor points.
el: θα εμφανίσετε τα σήματα που αντιστοιχούν στους επιλεγμένους ελεγκτές.

source: The canvas can be restored to its default state
el: Η περιοχή σχεδίασης μπορεί να επαναφερθεί στην αρχική της κατάσταση

source: of position and zoomby
el: θέσης και μεγέθυνσης

source: selecting the center button.
el: επιλέγοντας το εικονίδιο "Επαναφορά στο κέντρο".

source: Different monitor points can be set
el: Διαφορετικοί ελεγκτές μπορούν να προστεθούν

source: and zapped by first selecting the
el: και να αφαιρεθούν επιλέγοντας πρώτα την

source: Monitors tab on the right panel, and then
el: καρτέλα "Ελεγκτές" στο δεξί μέρος της οθόνης, και έπειτα

source: selecting the desired monitor
el: επιλέγοντας τον επιθυμητό ελεγκτή

source: point from the list.
el: από τη λίστα.

source: Switches can be operated by first selecting
el: Οι διακόπτες μπορούν να αλλάξουν κατάσταση επιλέγοντας πρώτα

source: the Switches tab on the right
el: την καρτέλα "Διακόπτες" στο δεξί μέρος

source: panel, and then selecting the desired switches.
el: της οθόνης, και έπειτα επιλέγοντας τους επιθυμητούς διακόπτες.

source: Pick your language
el: Επιλέξτε τη γλώσσα σας

source: No file loaded. Please load a file.
el: Δεν έχει φορτωθεί αρχείο. Παρακαλώ φορτώστε ένα αρχείο.

source: File reloaded: {}
el: Ανανέωση αρχείου: {}

source: Logic Simulator Created by Psylinders 2019
el: Logic Simulator Δημιουργήθηκε από τους Psylinders 2019

source: About Logsim
el: Σχετικά με το Logsim

source: New text box value:
el: Νέα τιμή πεδίου κειμένου:

source: Names
el: Όνομα

source: Status
el: Κατ.

source: Number of errors encountered:
el: Αριθμός σφαλμάτων που συναντηθηκαν:

source: ***SyntaxError: invalid syntax. Expected
el: ***SyntaxError: λάθος σύνταξη. Αναμένεται

source: ***NameError: Keywords, devices and ports names
el: ***NameError: Λέξεις-κλειδιά, ονόματα συσκευών και θυρών

source: are reserved and cannot be used as identifiers.
el: είναι δεσμευμένες και δεν μπορούν να χρησιμοποιηθούν ως ονόματα.

source: ***NameError: An identifier was repeated.
el: ***NameError: Ένα όνομα χρησιμοποιήθηκε παραπάνω από δύο φορές.

source: All identifiers must have unique names.
el: Όλα τα ονόματα πρέπει να είναι μοναδικά.

source: ***TypeError: Inputs must be on the right
el: ***TypeError: Οι είσοδοι πρέπει είναι στη δεξιά

source: hand side of the connection definition
el: μεριά των ορισμών ενώσεων.

source: ***TypeError: Outputs must be on the left
el: ***TypeError: Οι έξοδοι πρέπει να είναι στην αριστερή

source: ***TypeError: Monitors can only be outputs.
el: ***TypeError: Οι έλεγχοι πρέπει να είναι έξοδοι.

source: ***NameError: A monitor was repeated.
el: ***NameError: Ένας έλεγχος έχει επαναχρησιμοποιηθεί.

source: All monitors must be unique.
el: Όλοι οι έλεγχοι πρέπει να είναι ξεχωριστοί.

source: ***TypeError: The device has no such output.
el: ***TypeError: Η συσκευή δεν έχει τέτοια έξοδο.

source: ***NameError: The device has not been previously
el: ***NameError: Η συσκευή δεν έχει

source: defined in DEVICES.
el: οριστεί στα DEVICES.

source: ***TypeError: The number of inputs and outputs
el: ***TypeError: Ο αριθμός των εισόδων και των εξόδων

source: must match unless you are specifying one output to
el: πρέπει να είναι ίσα, εκτός αν ορίζεται μία έξοδος σε

source: many inputs or all the inputs of a device at once
el: πολλές εισόδους ή όλες οι είσοδοι μιας συσκευής ταυτόχρονα.

source: ***ValueError: The input has already been
el: ***ValueError: Η είσοδος έχει

source: specified previously. Repeated assignment of
el: ήδη ανατεθεί. Επανηλημμένη ανάθεση

source: inputs is not allowed.
el: εισόδων δεν επιτρέπεται.

source: ***ValueError: The port specified does not exist
el: ***ValueError: Η συγκεκριμένη θύρα δεν υπάρχει

source: for such device or is out of bounds
el: για την συγκεκριμένη συσκευή ή είναι εκτός ορίων.

source: ***TypeError: Only gates can have simultaneous
el: ***TypeError: Μόνο οι θύρες μπορούν να έχουν πολλαπλές

source: assignment of all of its inputs.
el: ενώσεις των εισόδων τους.

source: ***TypeError: Too many or too few inputs
el: ***TypeError: Περισσότερες ή λιγότερες είσοδοι

source: have been assigned simultaneously to the device.
el: έχουν οριστεί για την συγκεκριμένη συσκευή.

source: When using simultaneous defintion the same number
el: Όταν χρησιμοποιήτε πολλαπλούς ορισμούς, οι συσκευές

source: of inputs as the device has must be given.
el: πρέπει να έχουν τον ίδιο αριθμό εισόδων με τις δωθήσες θύρες.

source: ***ValueError: Inputs have not been specificed
el: ***ValueError: Οι είσοδοι δεν έχουν οριστεί

source: for all DEVICES.
el: για όλες τις συσκευές.

source: DTYPE takes no number
el: Οι DTYPE δεν παίρνουν κανέναν αριθμό

source: SWITCH takes only 0 or 1
el: Οι SWITCH παίρνουν μόνο 0 ή 1

source: CLOCK takes only values greater than 0
el: Τα CLOCKS παίρνουν μόνο τιμές μεγαλύτερες του 0

source: NAND gates can only have 1 to 16 inputs
el: Οι NAND θύρες μπορούν να έχουν από 1 έως 16 εισόδους

source: AND gates can only have 1 to 16 inputs
el: Οι AND θύρες μπορούν να έχουν από 1 έως 16 εισόδους

source: NOR gates can only have 1 to 16 inputs
el: Οι NOR θύρες μπορούν να έχουν από 1 έως 16 εισόδους

source: OR gates can only have 1 to 16 inputs
el: Οι OR θύρες μπορούν να έχουν από 1 έως 16 εισόδους

source: XOR gates can only have 2 inputs
el: Οι XOR θύρες μπορούν να έχουν μόνο 2 εισόδους

source: SIGGEN requires a parameter to bespecified.
el: Οι SIGGEN απαιτούν μία παράμετρο για να οριστούν.

source: SIGGEN requires a 4 or 8 followed by a binary number.
el: Οι SIGGEN απαιτούν ένα '4' ή '8' ακολουθούμενο απο μία δυαδική ακολουθία
